SOAPtoREST/map1.json

{"Mappings":[{"Name":null,"Method":"GET","RouteTemplate":"getCitydWeatherByZip/{ZIP}","SoapBody":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n            <soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n                <soap:Body>\r\n                    <GetCityWeatherByZIP xmlns=\"http://ws.cdyne.com/WeatherWS/\">\r\n                        <ZIP>{ZIP}</ZIP>\r\n                    </GetCityWeatherByZIP>\r\n                </soap:Body>\r\n            </soap:Envelope>","SoapAction":"http://ws.cdyne.com/WeatherWS/GetCityWeatherByZIP","SoapUrl":"http://wsf.cdyne.com/WeatherWS/Weather.asmx","ContentType":"text/xml"},{"Name":null,"Method":"GET","RouteTemplate":"getWeatherInformation","SoapBody":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n            <soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n                <soap:Body>\r\n                </soap:Body>\r\n            </soap:Envelope>","SoapAction":"http://ws.cdyne.com/WeatherWS/GetWeatherInformation","SoapUrl":"http://wsf.cdyne.com/WeatherWS/Weather.asmx","ContentType":"text/xml"},{"Name":null,"Method":"GET","RouteTemplate":"getCityForecastByZip/{ZIP}","SoapBody":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n            <soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n                <soap:Body>\r\n                    <GetCityForecastByZIP xmlns=\"http://ws.cdyne.com/WeatherWS/\">\r\n                        <ZIP>{ZIP}</ZIP>\r\n                    </GetCityForecastByZIP>\r\n                </soap:Body>\r\n            </soap:Envelope>","SoapAction":"http://ws.cdyne.com/WeatherWS/GetCityForecastByZIP","SoapUrl":"http://wsf.cdyne.com/WeatherWS/Weather.asmx","ContentType":"text/xml"}]}